<a href="https://colab.research.google.com/github/avinashjairam/avinashjairam.github.io/blob/master/3_6_(basic_pandas_tutorials).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [11]:
# use 'pip install pandas' to install pandas
import pandas as pd

In [12]:
students_dictionary = {
                        "Name" : ["Bob", "Alice", "Joe", "Mike", "Lisa", "Tom"],
                        "Major": ["Accounting", "Finance", "Chemistry", "Art", "Engineering", "Art"],
                        "GPA"  : [3.5, 3.8, 3.2, 3.7, 4.0, 3.5],
                        "Age"  : [22, 23, 31, 40, 25, 30]
                      }

roster = pd.DataFrame(students_dictionary)

In [13]:
#use print(roster) if you are not using notebooks

In [14]:
roster

    Name        Major  GPA  Age
0    Bob   Accounting  3.5   22
1  Alice      Finance  3.8   23
2    Joe    Chemistry  3.2   31
3   Mike          Art  3.7   40
4   Lisa  Engineering  4.0   25
5    Tom          Art  3.5   30

In [15]:
# .head() returns the first 5 rows in the dataframe
roster.head()

    Name        Major  GPA  Age
0    Bob   Accounting  3.5   22
1  Alice      Finance  3.8   23
2    Joe    Chemistry  3.2   31
3   Mike          Art  3.7   40
4   Lisa  Engineering  4.0   25

In [16]:
#. tail() returns the bottom or last 5 rows in the dataframe
roster.tail()

    Name        Major  GPA  Age
1  Alice      Finance  3.8   23
2    Joe    Chemistry  3.2   31
3   Mike          Art  3.7   40
4   Lisa  Engineering  4.0   25
5    Tom          Art  3.5   30

In [17]:
# .head(n) - returns the first 'n' rows in the dataframe
roster.head(2)

    Name       Major  GPA  Age
0    Bob  Accounting  3.5   22
1  Alice     Finance  3.8   23

In [18]:
# .tail(n) - returns the last 'n' rows in the dataframe

roster.tail(3)

   Name        Major  GPA  Age
3  Mike          Art  3.7   40
4  Lisa  Engineering  4.0   25
5   Tom          Art  3.5   30

In [19]:
# .shape - returns a tuple of the dimensions of the dataset : rows/cols

roster.shape

(6, 4)

In [21]:
#returns a dataframe containing statistics of the columns
roster.describe()

            GPA        Age
count  6.000000   6.000000
mean   3.616667  28.500000
std    0.278687   6.715653
min    3.200000  22.000000
25%    3.500000  23.500000
50%    3.600000  27.500000
75%    3.775000  30.750000
max    4.000000  40.000000

In [22]:
#original dataset
roster

    Name        Major  GPA  Age
0    Bob   Accounting  3.5   22
1  Alice      Finance  3.8   23
2    Joe    Chemistry  3.2   31
3   Mike          Art  3.7   40
4   Lisa  Engineering  4.0   25
5    Tom          Art  3.5   30

In [23]:
# .T - returns a transpose of the dataset
roster.T

                0        1          2     3            4    5
Name          Bob    Alice        Joe  Mike         Lisa  Tom
Major  Accounting  Finance  Chemistry   Art  Engineering  Art
GPA           3.5      3.8        3.2   3.7            4  3.5
Age            22       23         31    40           25   30

In [25]:
# sorts the dataset: 0 sort rows, 1 sort columns, 

roster.sort_index(axis=0, ascending=False)

    Name        Major  GPA  Age
5    Tom          Art  3.5   30
4   Lisa  Engineering  4.0   25
3   Mike          Art  3.7   40
2    Joe    Chemistry  3.2   31
1  Alice      Finance  3.8   23
0    Bob   Accounting  3.5   22

In [29]:
#sorts a column in ascending order
roster.sort_values(by = 'Age')

    Name        Major  GPA  Age
0    Bob   Accounting  3.5   22
1  Alice      Finance  3.8   23
4   Lisa  Engineering  4.0   25
5    Tom          Art  3.5   30
2    Joe    Chemistry  3.2   31
3   Mike          Art  3.7   40

In [30]:
#Dataframe[‘column_name’] - returns the specific column
roster['GPA']

0    3.5
1    3.8
2    3.2
3    3.7
4    4.0
5    3.5
Name: GPA, dtype: float64

In [33]:
#Dataframe['start_row_num' : 'end_row_num'] - returns the specific rows in the dataframe

roster[1:3]

    Name      Major  GPA  Age
1  Alice    Finance  3.8   23
2    Joe  Chemistry  3.2   31

In [34]:
#original roster dataframe
roster

    Name        Major  GPA  Age
0    Bob   Accounting  3.5   22
1  Alice      Finance  3.8   23
2    Joe    Chemistry  3.2   31
3   Mike          Art  3.7   40
4   Lisa  Engineering  4.0   25
5    Tom          Art  3.5   30

In [36]:
#dataframe[dataframe['column_name'] > 0]

roster[ roster['GPA'] > 3.5]

    Name        Major  GPA  Age
1  Alice      Finance  3.8   23
3   Mike          Art  3.7   40
4   Lisa  Engineering  4.0   25